public/resume/index.html
<!DOCTYPE html>
<html lang="en-US"><head><title>Resume - elliott.io</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
<meta name="description"
    content="Experience | Education | Service | Talks
TL;DR MIT, CogSci. Peace Corps, Cape Verde. CMU, HCI. Pink Design, Service Design. CatapultPGH, Coworking space. LegalSifter, ML LegalTech Startup. PNC Fintech Incubator, Head of Design. Capital One, Wealth Management Sr Design Manager of Strategy.
Experience LikeNow ⊕ Head of Design
2022-Present Likenow is a mobile app aimed at bringing economic justice back to on-demand (Uber, Doordash, etc) gig workers, while also enabling many people who are not qualified for any other on-demand apps. ">
<link rel="canonical" href="http://localhost:1313/resume/" />


<link rel="icon" href="http://localhost:1313/favicon.ico" />


<link rel="apple-touch-icon" href="http://localhost:1313/touch-icon.png" />

  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/modern-normalize/1.1.0/modern-normalize.min.css" crossorigin="anonymous" referrerpolicy="no-referrer" />










<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
<link rel="preload" as="style"
      href="https://fonts.googleapis.com/css?family=Noto+Serif+SC|Noto+Emoji&display=swap" />
<link rel="stylesheet"
      href="https://fonts.googleapis.com/css?family=Noto+Serif+SC|Noto+Emoji&display=swap"
      media="print" onload="this.media='all'" />
<noscript>
<link rel="stylesheet"
      href="https://fonts.googleapis.com/css?family=Noto+Serif+SC&display=swap" />
</noscript>






<link rel="stylesheet" href="http://localhost:1313/css/hugo-tufte.min.css">



<link rel="stylesheet" href="http://localhost:1313/css/hugo-tufte-options.min.css">

<link rel="stylesheet" href="http://localhost:1313/css/hugo-tufte-override.css">

</head>
<body>


<article id="main">
  <section>
<h1 class="content-title">Resume</h1></section>

  

  <section>
<p>
<a href="#experience">Experience</a> | <a href="#education">Education</a> | <a href="#service">Service</a> | <a href="#talks">Talks</a></p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
TL;DR
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><strong>MIT</strong>, CogSci. <strong>Peace Corps</strong>, Cape Verde. <strong>CMU</strong>, HCI. <strong>Pink Design</strong>, Service Design. <strong>CatapultPGH</strong>, Coworking space. <strong>LegalSifter</strong>, ML LegalTech Startup. <strong>PNC Fintech Incubator</strong>, Head of Design. <strong>Capital One</strong>,  Wealth Management Sr Design Manager of Strategy.</p>
<hr>
</div>
</div>
<div id="outline-container-experience" class="outline-2">
<h2 id="experience">
Experience
</h2>
<div id="outline-text-experience" class="outline-text-2">
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
LikeNow
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p><label for="marginnote-1" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-1" class="margin-toggle"/>
<span class="marginnote">
<strong>Head of Design<br>
2022-Present</strong>
</span>

<a href="http://localhost:1313/posts/likenow/">Likenow</a> is a mobile app aimed at bringing economic justice back to on-demand (Uber, Doordash, etc) gig workers, while also enabling many people who are not qualified for any other on-demand apps. The model is simple, allow anyone to join the platform offering whatever skills they possess, while building an application much like Uber that connects those workers with customers in real-time, all for free for the workers.</p>
<p>
Developed the app from conception to iOS App Store (currently pending approval). Performed extensive field research participating in the on-demand app ecosystem as a worker, moved from research to wireframes to pixel-perfect mockups as the only full-time designer.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Capital One - Wealth Management
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p><label for="marginnote-2" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-2" class="margin-toggle"/>
<span class="marginnote">
<strong>Sr Design Manager of Strategy<br>
2021</strong>
</span>

Joined Capital One’s Wealth Management Group pre-launch. Managed all design aspects of the Direct to Consumer service launch while introducing <a href="http://localhost:1313/posts/service-blueprinting-to-align-an-organization/">Service Blueprints for alignment</a> to the group as a way of unifying the efforts of designers, developers, wealth management associates and regulators. </p>
<p>
In addition to bringing together stakeholders across the group around a single document my team owned, I was responsible for managing a cross-functional team tasked with designing the cultural shift for the group as Wealth Managers moved from a 1:1 service model to a team based model. Unfortunately, at the end of 2021, Capital One decided to terminate the wealth management department, laying off over 300 employees and the project came to an end.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
PNC Bank - Numo
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p><label for="marginnote-3" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-3" class="margin-toggle"/>
<span class="marginnote">
<strong>Head of Design<br>
2018-2020</strong>
</span>

Numo is a bank funded fintech incubator. Grew the group’s first design department while simultaneously developing financial product ideas and the process to evaluate them. Quarterly meeting with C-Suite of PNC (6th largest bank nationally) for funding approval for products.</p>
<p>
<strong>Founding Director of Numo&#39;s Corporate Startup Lab @ CMU.</strong> Strategically invested 1MM in PNC donations annually to research with the potential to  shape the future of the financial industry. Met with C-Suite members of PNC quarterly for feedback and guidance. Acted as primary client for entrepreneurial classes around CMU, evaluating student created startups.</p>
<p>
<strong>Venture Process.</strong> <a href="http://localhost:1313/posts/pitch-fest/">Designed</a> and iterated the internal process used to evaluate 100s of product concepts moving from back of napkin ideas to multi-million dollar board approvals. </p>
<p>
<strong>Design Thinking Workshop.</strong> Designed Rhetoric based curriculum as a means to create a communal language and understanding for design company-wide.</p>
<p>
<strong>Launched News for Sales Team Application.</strong> Moved from contextual inquires and semi-structured user interviews to managing a small engineering team and testing prototypes in the field. Cleared all regulatory hurdles to launch internally within PNC for the healthcare vertical.</p>
<p>
<strong>SBA-backed Loan Marketplace for Consumers.</strong> Worked with industry experts, PNC Financial Institutions Group and Underwriting teams to <a href="http://localhost:1313/posts/offset/">develop a product</a> to offer whole loans to consumers. Orchestrated dozens of stakeholders across multiple internal LOBs for PNC CCO, CIO, and CTO approval. </p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
LegalSifter
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p><label for="marginnote-4" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-4" class="margin-toggle"/>
<span class="marginnote">
<strong>Founder, Designer<br>
2013 - 2017</strong>
</span>

Founded LegalSifter to tackle the problems of small businesses’ inability to access affordable legal help. Raised $4 Million in venture funding to use a statistical natural language processing (AI) approach to legal aid.</p>
<p>
<strong>Founder</strong>  
Launched an MVP that received over 4,000 contracts organically on day one. Posted on Hacker News with a 25% sign-up rate for the first day on the front page.</p>
<p>
<strong>CEO</strong>  
Raised over 2MM in institutional investments (to date LS has raised over 6MM). Effectively grew the company from 1 to 15 employees. I successfully pivoted the company from consumer to B2B and secured our first enterprise client, <a href="LegalSifter From Consumer App to B2B|BNYMellon">LegalSifter From Consumer App to B2B|BNYMellon</a>.</p>
<p>
<strong>Designer</strong>  
Semi-structured interviews with 50+ potential users, longitudinal studies, and contextual inquiries guided the prototyping of the first interface. Prototyped a complex app that negotiated the complexity of AI generated imperfect data with novice users. Worked with engineering team to implement designs.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Catapult PGH
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p><label for="marginnote-5" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-5" class="margin-toggle"/>
<span class="marginnote">
<strong>Service Designer<br>
2010 - 2013</strong>
</span>

<a href="http://localhost:1313/posts/catapult/">Started</a> the first coworking space in Pittsburgh. Received grants, sited in Ph.D. thesis’ as the first donation based coworking space. Under my management, Catapult grew to nearly 100 members, and a 25% operating margin.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Pink Design  
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p><label for="marginnote-6" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-6" class="margin-toggle"/>
<span class="marginnote">
<strong>Service Designer<br>
2008 - 2010</strong>
</span>

<a href="http://localhost:1313/posts/pink-design/">Cofounded</a> one of the first Service Design consultancies in the country. Worked with large corporate clients such as GSK and McDonald’s and applied modern Service Design methodologies such as Service Blueprints, Personas, and Story-boarding. </p>
<hr>
</div>
</div>
</div>
</div>
<div id="outline-container-education" class="outline-2">
<h2 id="education">
Education
</h2>
<div id="outline-text-education" class="outline-text-2">
<p>
<label for="marginnote-7" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-7" class="margin-toggle"/>
<span class="marginnote">
<strong>Adjunct Instructor<br>
2019 - 2020</strong>
</span>

<strong>CMU Human Computer Interaction Master’s Program</strong>.
Simultaneously instructed several student groups working across multiple industries with paying clients while guiding them through UCD research and design processes such as Contextual Inquiry, Cognitive Walkthrough, Ideation, and Rapid Prototyping.</p>
<p>
<label for="marginnote-8" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-8" class="margin-toggle"/>
<span class="marginnote">
<strong>MS Human Computer Interaction<br>
2007-2008</strong>
</span>

<strong>CMU</strong>. Carried 75% over required course load for the duration of the program finishing with a 4.0 GPA. Lead Designer for Capstone project.</p>
<p>
<label for="marginnote-9" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-9" class="margin-toggle"/>
<span class="marginnote">
<strong>BS Brain and Cognitive Science<br>
2000-2004</strong>
</span>

<strong>MIT.</strong> Additional studies in computer science, fine arts, and architecture. Student Leader managing 50+ students for a semester long art installation in the main entry. Executive Board Member of the Black Student Union. Organized dorm student cooking group of 30 students. Computer Science internship with Texas Instruments. Taught high school computer science.</p>
<hr>
</div>
</div>
<div id="outline-container-service" class="outline-2">
<h2 id="service">
Service
</h2>
<div id="outline-text-service" class="outline-text-2">
<p>
<strong>Edgewood Volunteer Fire Department</strong>.
<label for="marginnote-10" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-10" class="margin-toggle"/>
<span class="marginnote">
<strong>Emergency Medical Technician<br>
2024-Present</strong>
</span>

Completed coursework to become a nationally acknowledged Emergency Medical Technician. Currently volunteering at Edgewood Fire Department.</p>
<p>
<strong>Sprout Fund</strong>.
<label for="marginnote-11" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-11" class="margin-toggle"/>
<span class="marginnote">
<strong>Decision Committee Member<br>
2010-2015</strong>
</span>

Worked with a team to determine community projects to be funded. Evaluated projects based on probability of success along with alignment with Sprout vision and values. Distributed ~1MM over my tenure.</p>
<p>
<strong>Coffee Disloyalty Card</strong>.
<label for="marginnote-12" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-12" class="margin-toggle"/>
<span class="marginnote">
<strong>Designer<br>
2013</strong>
</span>

Organized 8 warring coffee shops to increase positivity in the local coffee industry. Created a physical rewards card where customers received a free cup of coffee for visiting multiple non-affiliated coffee shops.</p>
<p>
<strong>Philadelphia Public Schools</strong>.
<label for="marginnote-13" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-13" class="margin-toggle"/>
<span class="marginnote">
<strong>High School Science Teacher<br>
2006</strong>
</span>

Taught high school Chemistry, Biology, and Health to over 200 students from 9th to 11th grade. Worked in various schools from arts focused to the Microsoft School of the Future to a school associated with large numbers of homicide and drug related crimes. Pursued Masters in Education at the University of Pennsylvania concurrently.</p>
<p>
<strong>Peace Corps, Cape Verde</strong>.
<label for="marginnote-14" class="margin-toggle marginnote-ind">⊕</label>
<input type="checkbox" id="marginnote-14" class="margin-toggle"/>
<span class="marginnote">
<strong>Volunteer<br>
2005</strong>
</span>

Immersive language training in Cape Verdian Creole and Portuguese. Taught basic computer skills to people of Cape Verde.</p>
<hr>
</div>
</div>
<div id="outline-container-talks" class="outline-2">
<h2 id="talks">
Talks
</h2>
<div id="outline-text-talks" class="outline-text-2">
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
CMU HCI 2019
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>Service Design graduate class guest lecture on coworking from the lens of design. See my writeup of the project <a href="http://localhost:1313/posts/catapult/">here</a>.</p>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
IXDA Pittsburgh 2018
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>How business and design have shifted and changed to accommodate the cultural shifts of the last 100 years.</p>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
World IA Day Pittsburgh 2018
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>Designing for imperfect computer generated data.  
<a href="https://slideslive.com/38905982/machinelearninggenerated-data">Watch the video on SlidesLive.</a></p>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Alphalab Startup Incubator
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p><a href="http://localhost:1313/posts/sparket/">Watch the video</a> right here on elliott.io.</p>
</div>
</div>
</div>
</div>
</section>
  <section><footer class="page-footer">
<hr />

<div class="previous-post" style="display:inline-block;">
  
</div>

<div class="next-post", style="display:inline-block;float:right;">
  
  <a class="link-reverse" href="http://localhost:1313/portfolio/?ref=footer">Portfolio »</a>
  
</div>

<ul class="page-footer-menu">
  
  
  
  

  

  

  

  

  

  

  

  

  

  

  
  
  
</ul>





</footer>
</section>
  <section><nav class="menu">
    <ul>
    
        <li><a href="http://localhost:1313/">Home</a></li>
    
        <li><a href="http://localhost:1313/posts/">Posts</a></li>
    
        <li><a href="http://localhost:1313/categories/">Categories</a></li>
    
        <li><a href="http://localhost:1313/portfolio/">Portfolio</a></li>
    
        <li><a href="http://localhost:1313/resume/">Resume</a></li>
    
        <li><a href="http://localhost:1313/about/">About</a></li>
    
    </ul>
</nav>
</section>
</article>





</body>

</html>
